# Brewfile for dotfiles
# Install with: brew bundle install
# Cleanup with: brew bundle cleanup (removes packages not in this file)
# Check status: brew bundle check

# ============================================================================
# Taps
# ============================================================================
tap "arl/arl"
tap "cesarferreira/tap"
tap "epk/epk"
tap "felixkratz/formulae"
tap "garrettkrohn/rolo"
tap "garrettkrohn/treekanga"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "joshmedeski/sesh"
tap "neovim/neovim"
tap "nikitabobko/tap"
tap "unhappychoice/tap"

# ============================================================================
# Core Development Tools
# ============================================================================
brew "git"
brew "gh"                    # GitHub CLI
brew "lazygit"
brew "git-filter-repo"
brew "gitmux"
brew "gittype"

# ============================================================================
# Programming Languages & Runtimes
# ============================================================================
brew "go"
brew "node"
brew "nvm"                   # Node Version Manager
brew "fnm"                   # Fast Node Manager
brew "python@3.12"
brew "python@3.13"
brew "python@3.14"
brew "ruby"
brew "openjdk"

# ============================================================================
# Build Tools & Package Managers
# ============================================================================
brew "maven"
brew "make"
brew "cmake"
brew "autoconf"
brew "m4"

# ============================================================================
# Python Tools
# ============================================================================
brew "pipenv"
brew "pipx"
brew "pyenv"
brew "uv"

# ============================================================================
# Shell & Terminal
# ============================================================================
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-vi-mode"
brew "starship"              # Prompt
brew "tmux"
brew "tmuxinator"
brew "tmuxinator-completion"

# ============================================================================
# Modern CLI Replacements
# ============================================================================
brew "bat"                   # Better cat
brew "fd"                    # Better find
brew "ripgrep"               # Better grep (rg)
brew "lsd"                   # Better ls
brew "zoxide"                # Better cd

# ============================================================================
# Fuzzy Finders & Navigation
# ============================================================================
brew "fzf"
brew "sesh"                  # Tmux session manager
brew "rolo"                  # Custom tool
brew "yazi"                  # File manager

# ============================================================================
# Text Processing & Utilities
# ============================================================================
brew "jq"                    # JSON processor
brew "yq"                    # YAML processor
brew "awk"
brew "gum"                   # Glamorous shell scripts
brew "tree"
brew "watch"
brew "dos2unix"

# ============================================================================
# Editor & Development
# ============================================================================
brew "neovim"
brew "clang-format"

# ============================================================================
# Database Tools
# ============================================================================
brew "postgresql@15"
brew "sqlite"
brew "lazysql"
brew "rainfrog"

# ============================================================================
# Docker & Containers
# ============================================================================
brew "docker"
brew "docker-completion"
brew "lazydocker"

# ============================================================================
# Cloud & DevOps
# ============================================================================
brew "awscli"
brew "terraform"
brew "flyway"
brew "goose"

# ============================================================================
# Security & Privacy
# ============================================================================
brew "gnupg"
brew "pass"
brew "pinentry"
brew "pinentry-mac"

# ============================================================================
# Network Tools
# ============================================================================
brew "nmap"
brew "telnet"
brew "wget"
brew "curl"
brew "hurl"                  # HTTP testing

# ============================================================================
# Testing & Development Tools
# ============================================================================
brew "act"                   # Run GitHub Actions locally
brew "mockery"

# ============================================================================
# Window Management (macOS)
# ============================================================================
brew "borders"

# ============================================================================
# Custom Projects
# ============================================================================
brew "treekanga"

# ============================================================================
# Miscellaneous
# ============================================================================
brew "goreleaser"
brew "delve"                 # Go debugger
brew "pv"                    # Pipe viewer
brew "qrencode"
brew "spotifyd"
brew "w3m"                   # Terminal web browser
brew "xclip"
brew "rip"                   # Safe rm replacement

# ============================================================================
# GUI Applications (Casks)
# ============================================================================
cask "aerospace"             # Tiling window manager
cask "alacritty"             # Terminal emulator
cask "wezterm@nightly"       # Terminal emulator
cask "discord"
cask "postman"
cask "spotify"
cask "stats"                 # System monitor
cask "keycastr"              # Keystroke visualizer
cask "mouseless"
cask "shortcat"

# ============================================================================
# Nerd Fonts
# ============================================================================
cask "font-0xproto-nerd-font"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-envy-code-r-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-m+-nerd-font"
cask "font-martian-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace"
cask "font-monaspace-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-mplus-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-opendyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-sf-mono-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"
